## [Portal GitOps Resources](https://ziggy.app.us.spacelift.io/stack/portal-gitops-resources/run/01KMPJ6Z51K3AMX1A0JHAE2Y8G) plan logs

<details>
<summary>Click here to expand</summary>

```
[01KMMXR5KNAJNAMY0TNA4E7QBE] Planning changes with 13 custom hooks...
🚀 Running TFLint...
[01KMPJ6Z51K3AMX1A0JHAE2Y8G] (TFLint) Initializing TFLint...
[01KMPJ6Z51K3AMX1A0JHAE2Y8G] (TFLint) Running TFLint scan...
[01KMPJ6Z51K3AMX1A0JHAE2Y8G] (TFLint) ✓ No TFLint issues found
[SpaceForge] Running hook: after_plan
[SpaceForge] Hook completed: after_plan
🚀 Running Infracost...
2026-03-27T02:36:06Z INFO Autodetected 1 Terraform project across 1 root module
2026-03-27T02:36:06Z INFO Found Terraform project "main" at directory "." using Terraform var files "terraform.tfvars"
2026-03-27T02:36:06Z INFO Output saved to infracost.custom.spacelift.json
--- Infracost ASCII Report ---
Project: main

 Name  Monthly Qty  Unit  Monthly Cost   
                                         
 OVERALL TOTAL                  $0.00 

*Usage costs can be estimated by updating Infracost Cloud settings, see docs for other options.

──────────────────────────────────
9 cloud resources were detected:
∙ 0 were estimated
∙ 9 were free

┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━┳━━━━━━━━━━━━┓
┃ Project                                            ┃ Baseline cost ┃ Usage cost* ┃ Total cost ┃
┣━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━╋━━━━━━━━━━━━┫
┃ main                                               ┃         $0.00 ┃           - ┃      $0.00 ┃
┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━┻━━━━━━━━━━━━┛
🚀 Running TruffleHog...
[SpaceForge] Running hook: after_plan
[SpaceForge] Hook completed: after_plan
🚀 Running Trivy...
[01KMPJ6Z51K3AMX1A0JHAE2Y8G] (Trivy) ✓ No security issues found
[SpaceForge] Running hook: after_plan
[SpaceForge] Hook completed: after_plan
🚀 Running Checkov...
[01KMPJ6Z51K3AMX1A0JHAE2Y8G] (Checkov) Running Checkov with arguments: --directory . --output json --quiet --soft-fail --download-external-modules true --skip-path state-credentials.tf --skip-path .external_modules --framework terraform,kubernetes,helm,secrets
[01KMMXR5KNAJNAMY0TNA4E7QBE] Still running...
[01KMPJ6Z51K3AMX1A0JHAE2Y8G] (Checkov) ✓ No security issues found
[SpaceForge] Running hook: after_plan
[SpaceForge] Hook completed: after_plan
google_service_account.cloudplatform_gsa: Refreshing state... [id=projects/cne-development/serviceAccounts/liferay-portal-poc-cp-iam@cne-development.iam.gserviceaccount.com]
data.google_client_config.default: Reading...
data.google_project.project: Reading...
data.google_client_config.default: Read complete after 0s [id=projects/cne-development/regions/us-central1/zones/]
2026-03-27T02:36:39.855Z [WARN]  Provider "provider[\"registry.opentofu.org/hashicorp/google\"]" produced an invalid plan for google_service_account.cloudplatform_gsa, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .description: planned value cty.StringVal("") for a non-computed attribute
      - .display_name: planned value cty.StringVal("") for a non-computed attribute
      - .disabled: planned value cty.False for a non-computed attribute
google_project_iam_member.cloudplatform_roles["roles/iam.serviceAccountAdmin"]: Refreshing state... [id=cne-development/roles/iam.serviceAccountAdmin/serviceAccount:liferay-portal-poc-cp-iam@cne-development.iam.gserviceaccount.com]
google_service_account_iam_member.cloudplatform_wi_binding: Refreshing state... [id=projects/cne-development/serviceAccounts/liferay-portal-poc-cp-iam@cne-development.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/serviceAccount:cne-development.svc.id.goog[crossplane-system/provider-gcp-cloudplatform]]
google_project_iam_member.cloudplatform_roles["roles/resourcemanager.projectIamAdmin"]: Refreshing state... [id=cne-development/roles/resourcemanager.projectIamAdmin/serviceAccount:liferay-portal-poc-cp-iam@cne-development.iam.gserviceaccount.com]
data.google_project.project: Read complete after 0s [id=projects/cne-development]
google_project_iam_member.provider_direct_iam["compute"]: Refreshing state... [id=cne-development/roles/compute.admin/principal://iam.googleapis.com/projects/1010819446150/locations/global/workloadIdentityPools/cne-development.svc.id.goog/subject/ns/crossplane-system/sa/provider-gcp-compute]
google_project_iam_member.provider_direct_iam["storage"]: Refreshing state... [id=cne-development/roles/storage.admin/principal://iam.googleapis.com/projects/1010819446150/locations/global/workloadIdentityPools/cne-development.svc.id.goog/subject/ns/crossplane-system/sa/provider-gcp-storage]
google_project_iam_member.provider_direct_iam["kms"]: Refreshing state... [id=cne-development/roles/cloudkms.admin/principal://iam.googleapis.com/projects/1010819446150/locations/global/workloadIdentityPools/cne-development.svc.id.goog/subject/ns/crossplane-system/sa/provider-gcp-kms]
google_project_iam_member.provider_direct_iam["sql"]: Refreshing state... [id=cne-development/roles/cloudsql.admin/principal://iam.googleapis.com/projects/1010819446150/locations/global/workloadIdentityPools/cne-development.svc.id.goog/subject/ns/crossplane-system/sa/provider-gcp-sql]
google_project_iam_member.secrets_accessor_permissions[0]: Refreshing state... [id=cne-development/roles/secretmanager.secretAccessor/principal://iam.googleapis.com/projects/1010819446150/locations/global/workloadIdentityPools/cne-development.svc.id.goog/subject/ns/external-secrets/sa/external-secrets/liferay_external_secrets_access//resource.name.startsWith('projects/1010819446150/secrets/liferay-certificates-') || resource.name.startsWith('projects/1010819446150/secrets/liferay-licenses-') || resource.name.startsWith('projects/1010819446150/secrets/liferay-credentials-gitops')]
kubernetes_cluster_role.eso_secret_writer: Refreshing state... [id=eso-cluster-secret-writer]
2026-03-27T02:36:41.219Z [WARN]  Provider "provider[\"registry.opentofu.org/hashicorp/google\"]" produced an invalid plan for google_project_iam_member.secrets_accessor_permissions[0], but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .condition[0].description: planned value cty.StringVal("") for a non-computed attribute
2026-03-27T02:36:41.342Z [WARN]  Provider "provider[\"registry.opentofu.org/hashicorp/kubernetes\"]" produced an invalid plan for kubernetes_cluster_role.eso_secret_writer, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .metadata[0].annotations: planned value cty.MapValEmpty(cty.String) for a non-computed attribute
      - .metadata[0].generate_name: planned value cty.StringVal("") for a non-computed attribute
      - .rule[0].non_resource_urls: planned value cty.ListValEmpty(cty.String) for a non-computed attribute
      - .rule[0].resource_names: planned value cty.ListValEmpty(cty.String) for a non-computed attribute
[01KMMXR5KNAJNAMY0TNA4E7QBE] Still running...
[01KMMXR5KNAJNAMY0TNA4E7QBE] Still running...
[01KMMXR5KNAJNAMY0TNA4E7QBE] Still running...
[01KMMXR5KNAJNAMY0TNA4E7QBE] Still running...
[01KMMXR5KNAJNAMY0TNA4E7QBE] Still running...
[01KMMXR5KNAJNAMY0TNA4E7QBE] Still running...
[01KMMXR5KNAJNAMY0TNA4E7QBE] Still running...
[01KMMXR5KNAJNAMY0TNA4E7QBE] Still running...
[01KMMXR5KNAJNAMY0TNA4E7QBE] Still running...
[01KMMXR5KNAJNAMY0TNA4E7QBE] Still running...
kubernetes_manifest.function_go_templating: Refreshing state...
kubernetes_manifest.function_environment_configs: Refreshing state...
kubernetes_manifest.function_auto_ready: Refreshing state...
kubernetes_manifest.secret_store: Refreshing state...
kubernetes_manifest.function_go_templating_runtime_config: Refreshing state...
kubernetes_manifest.function_environment_configs_runtime_config: Refreshing state...
kubernetes_manifest.function_auto_ready_runtime_config: Refreshing state...
kubernetes_manifest.argocd_gateway_proxy_config: Refreshing state...
[01KMMXR5KNAJNAMY0TNA4E7QBE] Still running...
[01KMMXR5KNAJNAMY0TNA4E7QBE] Still running...
[01KMMXR5KNAJNAMY0TNA4E7QBE] Still running...
kubernetes_manifest.argocd_gateway_class: Refreshing state...
kubernetes_manifest.infrastructure_appproject: Refreshing state...
[01KMMXR5KNAJNAMY0TNA4E7QBE] Still running...
kubernetes_cluster_role_binding.eso_secret_writer_binding: Refreshing state... [id=eso-cluster-secret-writer-binding]
2026-03-27T02:40:56.688Z [WARN]  Provider "provider[\"registry.opentofu.org/hashicorp/kubernetes\"]" produced an invalid plan for kubernetes_cluster_role_binding.eso_secret_writer_binding, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .metadata[0].annotations: planned value cty.MapValEmpty(cty.String) for a non-computed attribute
      - .metadata[0].generate_name: planned value cty.StringVal("") for a non-computed attribute
kubernetes_manifest.git_repo_credentials_external_secret["liferay"]: Refreshing state...
kubernetes_manifest.liferay_appproject: Refreshing state...
kubernetes_manifest.infrastructure_provider_application: Refreshing state...
2026-03-27T02:41:28.108Z [WARN]  Provider "registry.opentofu.org/hashicorp/kubernetes" produced an unexpected new value for kubernetes_manifest.infrastructure_provider_application during refresh.
      - .object.spec.sources[0].targetRevision: was cty.StringVal("0.0.1"), but now cty.StringVal("master")
      - .object.spec.sources[1].targetRevision: was cty.StringVal("0.0.1"), but now cty.StringVal("master")
kubernetes_manifest.infrastructure_applicationset: Refreshing state...
kubernetes_manifest.liferay_applicationset: Refreshing state...
2026-03-27T02:41:38.075Z [WARN]  Provider "registry.opentofu.org/hashicorp/kubernetes" produced an unexpected new value for kubernetes_manifest.infrastructure_applicationset during refresh.
      - .object.spec.template.spec.sources[0].targetRevision: was cty.StringVal("0.0.1"), but now cty.StringVal("master")

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

OpenTofu will perform the following actions:

  # kubernetes_manifest.argocd_gateway[0] will be created
  + resource "kubernetes_manifest" "argocd_gateway" {
      + manifest = {
          + apiVersion = "gateway.networking.k8s.io/v1"
          + kind       = "Gateway"
          + metadata   = {
              + labels    = {
                  + "app.kubernetes.io/component"  = "gitops-infrastructure"
                  + "app.kubernetes.io/managed-by" = "liferay-cloud-native-terraform"
                  + "app.kubernetes.io/name"       = "argocd-gateway"
                  + "app.kubernetes.io/part-of"    = "liferay-gitops"
                  + environment                    = "internal"
                  + "liferay.com/project"          = "liferay-cloud-native"
                }
              + name      = "argocd-gateway"
              + namespace = "argocd"
            }
          + spec       = {
              + gatewayClassName = "argocd-gateway-class"
              + listeners        = [
                  + {
                      + allowedRoutes = {
                          + namespaces = {
                              + from = "Same"
                            }
                        }
                      + hostname      = "argocd.paastrial.xyz"
                      + name          = "http"
                      + port          = 80
                      + protocol      = "HTTP"
                    },
                  + {
                      + allowedRoutes = {
                          + namespaces = {
                              + from = "Same"
                            }
                        }
                      + hostname      = "argocd.paastrial.xyz"
                      + name          = "https"
                      + port          = 443
                      + protocol      = "HTTPS"
                      + tls           = {
                          + certificateRefs = [
                              + {
                                  + name = "argocd-server-tls"
                                },
                            ]
                          + mode            = "Terminate"
                        }
                    },
                ]
            }
        }
      + object   = {
          + apiVersion = "gateway.networking.k8s.io/v1"
          + kind       = "Gateway"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "argocd-gateway"
              + namespace                  = "argocd"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + addresses        = (known after apply)
              + allowedListeners = {
                  + namespaces = {
                      + from     = (known after apply)
                      + selector = {
                          + matchExpressions = (known after apply)
                          + matchLabels      = (known after apply)
                        }
                    }
                }
              + defaultScope     = (known after apply)
              + gatewayClassName = "argocd-gateway-class"
              + infrastructure   = {
                  + annotations   = (known after apply)
                  + labels        = (known after apply)
                  + parametersRef = {
                      + group = (known after apply)
                      + kind  = (known after apply)
                      + name  = (known after apply)
                    }
                }
              + listeners        = [
                  + {
                      + allowedRoutes = {
                          + kinds      = (known after apply)
                          + namespaces = {
                              + from     = "Same"
                              + selector = {
                                  + matchExpressions = (known after apply)
                                  + matchLabels      = (known after apply)
                                }
                            }
                        }
                      + hostname      = "argocd.paastrial.xyz"
                      + name          = "http"
                      + port          = 80
                      + protocol      = "HTTP"
                      + tls           = {
                          + certificateRefs = (known after apply)
                          + mode            = (known after apply)
                          + options         = (known after apply)
                        }
                    },
                  + {
                      + allowedRoutes = {
                          + kinds      = (known after apply)
                          + namespaces = {
                              + from     = "Same"
                              + selector = {
                                  + matchExpressions = (known after apply)
                                  + matchLabels      = (known after apply)
                                }
                            }
                        }
                      + hostname      = "argocd.paastrial.xyz"
                      + name          = "https"
                      + port          = 443
                      + protocol      = "HTTPS"
                      + tls           = {
                          + certificateRefs = [
                              + {
                                  + group     = (known after apply)
                                  + kind      = (known after apply)
                                  + name      = "argocd-server-tls"
                                  + namespace = (known after apply)
                                },
                            ]
                          + mode            = "Terminate"
                          + options         = (known after apply)
                        }
                    },
                ]
              + tls              = {
                  + backend  = {
                      + clientCertificateRef = {
                          + group     = (known after apply)
                          + kind      = (known after apply)
                          + name      = (known after apply)
                          + namespace = (known after apply)
                        }
                    }
                  + frontend = {
                      + default = {
                          + validation = {
                              + caCertificateRefs = (known after apply)
                              + mode              = (known after apply)
                            }
                        }
                      + perPort = (known after apply)
                    }
                }
            }
        }
    }

  # kubernetes_manifest.argocd_httproute[0] will be created
  + resource "kubernetes_manifest" "argocd_httproute" {
      + manifest = {
          + apiVersion = "gateway.networking.k8s.io/v1"
          + kind       = "HTTPRoute"
          + metadata   = {
              + labels    = {
                  + "app.kubernetes.io/component"  = "gitops-infrastructure"
                  + "app.kubernetes.io/managed-by" = "liferay-cloud-native-terraform"
                  + "app.kubernetes.io/name"       = "argocd-server-route"
                  + "app.kubernetes.io/part-of"    = "liferay-gitops"
                  + environment                    = "internal"
                  + "liferay.com/project"          = "liferay-cloud-native"
                }
              + name      = "argocd-server-route"
              + namespace = "argocd"
            }
          + spec       = {
              + hostnames  = [
                  + "argocd.paastrial.xyz",
                ]
              + parentRefs = [
                  + {
                      + name        = "argocd-gateway"
                      + sectionName = "https"
                    },
                ]
              + rules      = [
                  + {
                      + backendRefs = [
                          + {
                              + name = "argocd-server"
                              + port = 80
                            },
                        ]
                    },
                ]
            }
        }
      + object   = {
          + apiVersion = "gateway.networking.k8s.io/v1"
          + kind       = "HTTPRoute"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "argocd-server-route"
              + namespace                  = "argocd"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + hostnames          = [
                  + "argocd.paastrial.xyz",
                ]
              + parentRefs         = [
                  + {
                      + group       = (known after apply)
                      + kind        = (known after apply)
                      + name        = "argocd-gateway"
                      + namespace   = (known after apply)
                      + port        = (known after apply)
                      + sectionName = "https"
                    },
                ]
              + rules              = [
                  + {
                      + backendRefs        = [
                          + {
                              + filters   = (known after apply)
                              + group     = (known after apply)
                              + kind      = (known after apply)
                              + name      = "argocd-server"
                              + namespace = (known after apply)
                              + port      = 80
                              + weight    = (known after apply)
                            },
                        ]
                      + filters            = (known after apply)
                      + matches            = (known after apply)
                      + name               = (known after apply)
                      + retry              = {
                          + attempts = (known after apply)
                          + backoff  = (known after apply)
                          + codes    = (known after apply)
                        }
                      + sessionPersistence = {
                          + absoluteTimeout = (known after apply)
                          + cookieConfig    = {
                              + lifetimeType = (known after apply)
                            }
                          + idleTimeout     = (known after apply)
                          + sessionName     = (known after apply)
                          + type            = (known after apply)
                        }
                      + timeouts           = {
                          + backendRequest = (known after apply)
                          + request        = (known after apply)
                        }
                    },
                ]
              + useDefaultGateways = (known after apply)
            }
        }
    }

  # kubernetes_manifest.argocd_https_redirect[0] will be created
  + resource "kubernetes_manifest" "argocd_https_redirect" {
      + manifest = {
          + apiVersion = "gateway.networking.k8s.io/v1"
          + kind       = "HTTPRoute"
          + metadata   = {
              + labels    = {
                  + "app.kubernetes.io/component"  = "gitops-infrastructure"
                  + "app.kubernetes.io/managed-by" = "liferay-cloud-native-terraform"
                  + "app.kubernetes.io/name"       = "argocd-redirect-route"
                  + "app.kubernetes.io/part-of"    = "liferay-gitops"
                  + environment                    = "internal"
                  + "liferay.com/project"          = "liferay-cloud-native"
                }
              + name      = "argocd-redirect-route"
              + namespace = "argocd"
            }
          + spec       = {
              + hostnames  = [
                  + "argocd.paastrial.xyz",
                ]
              + parentRefs = [
                  + {
                      + name        = "argocd-gateway"
                      + sectionName = "http"
                    },
                ]
              + rules      = [
                  + {
                      + filters = [
                          + {
                              + requestRedirect = {
                                  + scheme     = "https"
                                  + statusCode = 301
                                }
                              + type            = "RequestRedirect"
                            },
                        ]
                    },
                ]
            }
        }
      + object   = {
          + apiVersion = "gateway.networking.k8s.io/v1"
          + kind       = "HTTPRoute"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "argocd-redirect-route"
              + namespace                  = "argocd"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + hostnames          = [
                  + "argocd.paastrial.xyz",
                ]
              + parentRefs         = [
                  + {
                      + group       = (known after apply)
                      + kind        = (known after apply)
                      + name        = "argocd-gateway"
                      + namespace   = (known after apply)
                      + port        = (known after apply)
                      + sectionName = "http"
                    },
                ]
              + rules              = [
                  + {
                      + backendRefs        = (known after apply)
                      + filters            = [
                          + {
                              + cors                   = {
                                  + allowCredentials = (known after apply)
                                  + allowHeaders     = (known after apply)
                                  + allowMethods     = (known after apply)
                                  + allowOrigins     = (known after apply)
                                  + exposeHeaders    = (known after apply)
                                  + maxAge           = (known after apply)
                                }
                              + extensionRef           = {
                                  + group = (known after apply)
                                  + kind  = (known after apply)
                                  + name  = (known after apply)
                                }
                              + externalAuth           = {
                                  + backendRef  = {
                                      + group     = (known after apply)
                                      + kind      = (known after apply)
                                      + name      = (known after apply)
                                      + namespace = (known after apply)
                                      + port      = (known after apply)
                                    }
                                  + forwardBody = {
                                      + maxSize = (known after apply)
                                    }
                                  + grpc        = {
                                      + allowedHeaders = (known after apply)
                                    }
                                  + http        = {
                                      + allowedHeaders         = (known after apply)
                                      + allowedResponseHeaders = (known after apply)
                                      + path                   = (known after apply)
                                    }
                                  + protocol    = (known after apply)
                                }
                              + requestHeaderModifier  = {
                                  + add    = (known after apply)
                                  + remove = (known after apply)
                                  + set    = (known after apply)
                                }
                              + requestMirror          = {
                                  + backendRef = {
                                      + group     = (known after apply)
                                      + kind      = (known after apply)
                                      + name      = (known after apply)
                                      + namespace = (known after apply)
                                      + port      = (known after apply)
                                    }
                                  + fraction   = {
                                      + denominator = (known after apply)
                                      + numerator   = (known after apply)
                                    }
                                  + percent    = (known after apply)
                                }
                              + requestRedirect        = {
                                  + hostname   = (known after apply)
                                  + path       = {
                                      + replaceFullPath    = (known after apply)
                                      + replacePrefixMatch = (known after apply)
                                      + type               = (known after apply)
                                    }
                                  + port       = (known after apply)
                                  + scheme     = "https"
                                  + statusCode = 301
                                }
                              + responseHeaderModifier = {
                                  + add    = (known after apply)
                                  + remove = (known after apply)
                                  + set    = (known after apply)
                                }
                              + type                   = "RequestRedirect"
                              + urlRewrite             = {
                                  + hostname = (known after apply)
                                  + path     = {
                                      + replaceFullPath    = (known after apply)
                                      + replacePrefixMatch = (known after apply)
                                      + type               = (known after apply)
                                    }
                                }
                            },
                        ]
                      + matches            = (known after apply)
                      + name               = (known after apply)
                      + retry              = {
                          + attempts = (known after apply)
                          + backoff  = (known after apply)
                          + codes    = (known after apply)
                        }
                      + sessionPersistence = {
                          + absoluteTimeout = (known after apply)
                          + cookieConfig    = {
                              + lifetimeType = (known after apply)
                            }
                          + idleTimeout     = (known after apply)
                          + sessionName     = (known after apply)
                          + type            = (known after apply)
                        }
                      + timeouts           = {
                          + backendRequest = (known after apply)
                          + request        = (known after apply)
                        }
                    },
                ]
              + useDefaultGateways = (known after apply)
            }
        }
    }

  # kubernetes_manifest.argocd_server_tls_external_secret[0] will be created
  + resource "kubernetes_manifest" "argocd_server_tls_external_secret" {
      + manifest = {
          + apiVersion = "external-secrets.io/v1"
          + kind       = "ExternalSecret"
          + metadata   = {
              + labels    = {
                  + "app.kubernetes.io/component"  = "gitops-infrastructure"
                  + "app.kubernetes.io/managed-by" = "liferay-cloud-native-terraform"
                  + "app.kubernetes.io/part-of"    = "liferay-gitops"
                  + environment                    = "internal"
                  + "liferay.com/project"          = "liferay-cloud-native"
                }
              + name      = "argocd-server-tls"
              + namespace = "argocd"
            }
          + spec       = {
              + dataFrom        = [
                  + {
                      + extract = {
                          + decodingStrategy = "Auto"
                          + key              = "liferay-certificates-paastrial-xyz-tls-secret"
                        }
                    },
                ]
              + refreshInterval = "1h0m0s"
              + secretStoreRef  = {
                  + kind = "ClusterSecretStore"
                  + name = "liferay-portal-poc-secret-store"
                }
              + target          = {
                  + creationPolicy = "Owner"
                  + name           = "argocd-server-tls"
                  + template       = {
                      + metadata = {
                          + labels = {
                              + "app.kubernetes.io/component"  = "gitops-infrastructure"
                              + "app.kubernetes.io/managed-by" = "liferay-cloud-native-terraform"
                              + "app.kubernetes.io/name"       = "argocd-server-tls"
                              + "app.kubernetes.io/part-of"    = "liferay-gitops"
                              + environment                    = "internal"
                              + "liferay.com/project"          = "liferay-cloud-native"
                            }
                        }
                      + type     = "kubernetes.io/tls"
                    }
                }
            }
        }
      + object   = {
          + apiVersion = "external-secrets.io/v1"
          + kind       = "ExternalSecret"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "argocd-server-tls"
              + namespace                  = "argocd"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + data            = (known after apply)
              + dataFrom        = [
                  + {
                      + extract   = {
                          + conversionStrategy = (known after apply)
                          + decodingStrategy   = "Auto"
                          + key                = "liferay-certificates-paastrial-xyz-tls-secret"
                          + metadataPolicy     = (known after apply)
                          + property           = (known after apply)
                          + version            = (known after apply)
                        }
                      + find      = {
                          + conversionStrategy = (known after apply)
                          + decodingStrategy   = (known after apply)
                          + name               = {
                              + regexp = (known after apply)
                            }
                          + path               = (known after apply)
                          + tags               = (known after apply)
                        }
                      + rewrite   = (known after apply)
                      + sourceRef = {
                          + generatorRef = {
                              + apiVersion = (known after apply)
                              + kind       = (known after apply)
                              + name       = (known after apply)
                            }
                          + storeRef     = {
                              + kind = (known after apply)
                              + name = (known after apply)
                            }
                        }
                    },
                ]
              + refreshInterval = "1h0m0s"
              + refreshPolicy   = (known after apply)
              + secretStoreRef  = {
                  + kind = "ClusterSecretStore"
                  + name = "liferay-portal-poc-secret-store"
                }
              + target          = {
                  + creationPolicy = "Owner"
                  + deletionPolicy = (known after apply)
                  + immutable      = (known after apply)
                  + manifest       = {
                      + apiVersion = (known after apply)
                      + kind       = (known after apply)
                    }
                  + name           = "argocd-server-tls"
                  + template       = {
                      + data          = (known after apply)
                      + engineVersion = (known after apply)
                      + mergePolicy   = (known after apply)
                      + metadata      = {
                          + annotations = (known after apply)
                          + finalizers  = (known after apply)
                          + labels      = {
                              + "app.kubernetes.io/component"  = "gitops-infrastructure"
                              + "app.kubernetes.io/managed-by" = "liferay-cloud-native-terraform"
                              + "app.kubernetes.io/name"       = "argocd-server-tls"
                              + "app.kubernetes.io/part-of"    = "liferay-gitops"
                              + environment                    = "internal"
                              + "liferay.com/project"          = "liferay-cloud-native"
                            }
                        }
                      + templateFrom  = (known after apply)
                      + type          = "kubernetes.io/tls"
                    }
                }
            }
        }

      + field_manager {
          + force_conflicts = true
          + name            = "liferay-cloud-native-terraform"
        }
    }

  # kubernetes_manifest.infrastructure_applicationset will be updated in-place
  ~ resource "kubernetes_manifest" "infrastructure_applicationset" {
      ~ object   = {
          ~ spec       = {
              ~ template                     = {
                  ~ spec     = {
                      ~ sources              = [
                          ~ {
                                name           = null
                              ~ targetRevision = "master" -> "0.0.1"
                                # (8 unchanged attributes hidden)
                            },
                            {
                                chart          = null
                                directory      = {
                                    exclude = null
                                    include = null
                                    jsonnet = {
                                        extVars = null
                                        libs    = null
                                        tlas    = null
                                    }
                                    recurse = null
                                }
                                helm           = {
                                    apiVersions             = null
                                    fileParameters          = null
                                    ignoreMissingValueFiles = null
                                    kubeVersion             = null
                                    namespace               = null
                                    parameters              = null
                                    passCredentials         = null
                                    releaseName             = null
                                    skipCrds                = null
                                    skipSchemaValidation    = null
                                    skipTests               = null
                                    valueFiles              = null
                                    values                  = null
                                    valuesObject            = null
                                    version                 = null
                                }
                                kustomize      = {
                                    apiVersions               = null
                                    commonAnnotations         = null
                                    commonAnnotationsEnvsubst = null
                                    commonLabels              = null
                                    components                = null
                                    forceCommonAnnotations    = null
                                    forceCommonLabels         = null
                                    ignoreMissingComponents   = null
                                    images                    = null
                                    kubeVersion               = null
                                    labelIncludeTemplates     = null
                                    labelWithoutSelector      = null
                                    namePrefix                = null
                                    nameSuffix                = null
                                    namespace                 = null
                                    patches                   = null
                                    replicas                  = null
                                    version                   = null
                                }
                                name           = null
                                path           = null
                                plugin         = {
                                    env        = null
                                    name       = null
                                    parameters = null
                                }
                                ref            = "values"
                                repoURL        = "https://github.com/Ziggy-AZ/cloud-native-gitops-boilerplate-gcp-2026-02-27.git"
                                targetRevision = "HEAD"
                            },
                        ]
                        # (8 unchanged attributes hidden)
                    }
                    # (1 unchanged attribute hidden)
                }
                # (9 unchanged attributes hidden)
            }
            # (3 unchanged attributes hidden)
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # kubernetes_manifest.infrastructure_provider_application will be updated in-place
  ~ resource "kubernetes_manifest" "infrastructure_provider_application" {
      ~ object   = {
          ~ spec       = {
              ~ sources              = [
                  ~ {
                        name           = null
                      ~ targetRevision = "master" -> "0.0.1"
                        # (8 unchanged attributes hidden)
                    },
                  ~ {
                        name           = null
                      ~ targetRevision = "master" -> "0.0.1"
                        # (8 unchanged attributes hidden)
                    },
                    {
                        chart          = null
                        directory      = {
                            exclude = null
                            include = null
                            jsonnet = {
                                extVars = null
                                libs    = null
                                tlas    = null
                            }
                            recurse = null
                        }
                        helm           = {
                            apiVersions             = null
                            fileParameters          = null
                            ignoreMissingValueFiles = null
                            kubeVersion             = null
                            namespace               = null
                            parameters              = null
                            passCredentials         = null
                            releaseName             = null
                            skipCrds                = null
                            skipSchemaValidation    = null
                            skipTests               = null
                            valueFiles              = null
                            values                  = null
                            valuesObject            = null
                            version                 = null
                        }
                        kustomize      = {
                            apiVersions               = null
                            commonAnnotations         = null
                            commonAnnotationsEnvsubst = null
                            commonLabels              = null
                            components                = null
                            forceCommonAnnotations    = null
                            forceCommonLabels         = null
                            ignoreMissingComponents   = null
                            images                    = null
                            kubeVersion               = null
                            labelIncludeTemplates     = null
                            labelWithoutSelector      = null
                            namePrefix                = null
                            nameSuffix                = null
                            namespace                 = null
                            patches                   = null
                            replicas                  = null
                            version                   = null
                        }
                        name           = null
                        path           = null
                        plugin         = {
                            env        = null
                            name       = null
                            parameters = null
                        }
                        ref            = "values"
                        repoURL        = "https://github.com/Ziggy-AZ/cloud-native-gitops-boilerplate-gcp-2026-02-27.git"
                        targetRevision = "HEAD"
                    },
                ]
                # (8 unchanged attributes hidden)
            }
            # (4 unchanged attributes hidden)
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

Plan: 4 to add, 2 to change, 0 to destroy.

[01KMMXR5KNAJNAMY0TNA4E7QBE] Changes are GO
[01KMMXR5KNAJNAMY0TNA4E7QBE] Generating JSON representation of the plan...
[01KMMXR5KNAJNAMY0TNA4E7QBE] JSON representation is GO
[01KMMXR5KNAJNAMY0TNA4E7QBE] Generating Infracost JSON report from plan

[01KMMXR5KNAJNAMY0TNA4E7QBE] Infracost report generated successfully
[01KMMXR5KNAJNAMY0TNA4E7QBE] Uploading the list of managed resources...
[01KMMXR5KNAJNAMY0TNA4E7QBE] Infracost report found from previous steps
[01KMMXR5KNAJNAMY0TNA4E7QBE] Mapping Infracost data to resources
[01KMMXR5KNAJNAMY0TNA4E7QBE] Costs mapped successfully
[01KMMXR5KNAJNAMY0TNA4E7QBE] Please be aware that the run changes calculation includes output changes.
[01KMMXR5KNAJNAMY0TNA4E7QBE] Resource list upload is GO
[01KMMXR5KNAJNAMY0TNA4E7QBE] Loading custom plan policy inputs...
[01KMMXR5KNAJNAMY0TNA4E7QBE] 4 custom plan policy inputs found: checkov, infracost, tflint, trivy
[01KMMXR5KNAJNAMY0TNA4E7QBE] Evaluated 6 plan policies
[01KMMXR5KNAJNAMY0TNA4E7QBE] Plan policy warning: 

🛠️ SECURITY & COST SUMMARY

💰 Cost Estimate: Total Monthly: $0 (Change: $0)

🛡️ Checkov: PASS (0 Failed Checks)

🛡️ Trivy: PASS (0 Findings)

🔍 TFLint: PASS (0 Issues)

🐽 TruffleHog: No data available.


[01KMMXR5KNAJNAMY0TNA4E7QBE] Plan checks are GO
```

</details>